#!/usr/bin/php
<?php

# this code for blog article: http://www.stutostu.com/?p=1312

$str = '反正也失业，为了让时间过得有意义一点，我觉得去旅游一次。。。从3月22号决定去，到3月25日出发，仅仅3天的时间准备攻略。。。

我们旅游的行程安排大致如下，有部分行程是去到再完善的。。

day1  3月25号  下午5点  坐 广州-昆明  的火车正式踏上旅程。。
day2  3月26号  晚上8点到达昆明，当晚10点 乘坐 昆明-丽江 的火车
day3  3月27号  早上7点到达丽江，入住青年旅舍，在丽江古城逛逛，下午到束河古镇玩玩
day4  3月28号  预定明天 丽江-泸沽湖 的车票，入住客栈，当天在丽江找各种好吃的
day5  3月29号  早上7点半出发去泸沽湖，当天下午2点半到达里格村，搭车到情人滩，入住客栈
day6  3月30号  早上到泸沽湖划船，中午出发到草海，入住客栈，下午徒步至赵家湾
day7  3月31号  早上截顺风车到达泸沽镇，解决午餐，搭车到大落水，中午到达后入住青年旅舍，预订火车票以及第二天泸沽湖回丽江的车。
day8  4月1号  早上11点半坐车回丽江，下午5点多到达，到丽江新城逛逛超市，补充干粮，晚上做丽江-大理的火车，当晚10点到达，搭车到大理古城，入住青年旅舍
day9  4月2号   租自行车环游古城，上午去影视城，下午去才村码头，环海西路。晚上8点坐车去火车站，乘坐当晚10点大理-昆明的火车
day10  4月3号  早上6点到达昆明，领票后去候车室充电。。。当天去翠湖公园，云南大学以及世博园游玩。下午5点乘坐昆明-广州的火车。。
day11 4月4号  晚上8点到达，结束旅程。。。

day1

还记得当天有点紧张，见到天气灰层层的，似乎就要下雨之际，所以早早就出发去火车站，到了才发现，我擦，竟然提前了2个小时到了火车站。。。不得不说，火车站附近的宜家的热狗套餐还算不错，5元无限续杯。。。就这样解决了当天的晚餐—！

上车咯，临近上车，还不知道原来火车站就在地铁站的上面，害我到处问人才解决了这个问题。。。

刚找到自己的床位坐下，就被一位大叔问我可以换位置不，因为他们是南宁下，我们是昆明下，所以，我就没答应和他们换。。。后来了解到这位大叔是在收容所工作，当天要护送一位收容所的人回南宁，而他护送那位有点神经问题的病人就睡在我隔壁床，我了个去了！！！怎么可以这样。。。。幸亏后来也没发生什么事。。。

后来在火车上又认识一位朋友，他是在广州读本科，在南宁读研究生的医学系的。。。在火车上也和他聊了关于目前医生，医院收费，道德等等的问题。。。总结，学医很苦，待遇好的话，医生也不会整天想着拿红包。。



day2

果然在火车上睡眠质量很低。。。一个晚上都是迷迷糊糊的感觉。。坐了硬卧才知道，下铺是最好的，上铺是最坏的，上铺空间太小了，仅仅是用来睡觉，坐起来都是问题。。。

今天也在火车上认识2位朋友，1位也是从广州出发的，叫峰哥，他是做酒店管理那方面的，也是准备出来旅游，一次性用光假期，然后回去辞职。他之前也来丽江这边玩过，不过这次他是直奔大理去的。在火车上聊了关于丽江那边有什么好玩的等等，最后我们也加了微信保持联系。

后来也认识1位女性朋友，她是在昆明读书，现在是大四，来广州这边玩。。。多亏了她，后来我们在昆明才玩得那么开心。。。

晚上8点多的时候，终于到了昆明站，由于昆明到丽江的车是10点半的，我们就出去外面找点吃的解决晚餐。。。记得走远点，离火车站近的消费都比较贵。。。最终吃了碗牛肉面，7块钱，味道貌似还不错~~

10点的时候已经可以检票进站了。。。这列火车是上下双层的，连洗手间都很豪华的样子。。。然后在火车上认识一位从北京过来丽江玩的朋友，她们也是2个人，后来我们一拍即合，拼成1个4人团在丽江玩。。。



day3

早上7点多的时候，终于到丽江站了。。。出来就觉得有点冷，看来丽江还是比昆明冷的。。。本来打算和北京那两位朋友拼车的，但是一出火车就不见人了。。算鸟，反正自己做好了功课，准备搭公交车过去~~



在我们拍照的时候，有位阿姨过来搭讪，说面包车5块钱1个人，我想起攻略说的是10块钱，心想不会骗人的吧，就没有理会，但是这个阿姨说了很多他们是正规营运车什么的，最终还是选择相信了她，的确他们是正规营运车，我只是觉得奇怪，为什么和攻略价格差那么多。。。一问，噢，原来是淡季的原因。。。车上一共4个人，另外2个人是从重庆过来玩的美女，由于其高傲的性格，本人就不打算和她们搭话太多。。。

不过一会儿，面包车就安全的把我们送到目的地。。。打电话给客栈老板出来接我们。。。安顿休息好之后，我们就出去丽江古城闲逛~~话说丽江古城的小吃不咋地，不怎么符合我们的胃口。。。

就这样没目的的到处闲逛，其实我真的害怕认不得回去客栈的路了。。。不过人的潜能还是很强大了，实践证明，乱走还是可以走回去的，哈哈哈~。。。

我们在去观景台的路上，竟然能在一家卖XX纸的店里遇到北京那2个朋友，真是太惊讶了。。。 后来我们一起商量了下下午的行程，决定去束河古镇那边玩。。。后来就翻山越岭穿过观景台那边，到达公交车站，搭车过去束河古镇。。。

实话说束河古镇真远，公交站下车后，还要走路20分钟才能走到。。。擦，太远了。。。大家都说束河古镇安静点，没那么商业化。。。但是我真的feel不到咯~~，在那边点了点小吃，喝个下午茶，但是大家的评价都是味道不好~~ 也是到处逛逛，然后大家都打的回去了，多亏北京那两位朋友顺利把价格从30元打压到20元。。。后来大家的评价就是，束河古镇真的不咋D，感觉就像一个公园那样。。。

晚上的话我们在丽江古城那边吃饭，这个餐厅叫什么私房菜的，果然，还是女孩子懂吃，4个人，平均1个人吃了30多块。。。这算是我来丽江吃到最好吃的了吧。。。

我们的晚餐

水性杨花味道不错，其他的我都觉得味道太重，油太多了。。。

就这样解决了晚餐问题。。。护送2位女同学回旅店哦，我们开始纠结怎么回去了。。。用手机打开百度地图，边走边看，乱打乱撞的回到了我们的旅馆，真是汗呐。。。

本来大家约好晚上出来玩的，但是，由于下午去束河古镇玩了一个下午的缘故，大家洗完澡都觉得不想出来了。。。我也是想着直接在客栈里休息算鸟。。。但是，我另外那个朋友不断的怂恿我出去玩，好吧，他成功了。。。。

后来，我们2个大男人出去逛了一圈后觉得不对劲，太没意思了。。。就在四方街那里坐坐，后来听到酒吧里传来的live音乐。哎呀，我的天哪，感觉不错呀，后来我们俩就决定去酒吧泡。。。擦，一进去问，一瓶啤酒35元，我勒个去了，考虑到面子问题，我擦，忍了。。。不过事后也觉得，也正常，因为很多人都是买瓶啤酒就在那里听一个晚上的live music。。。



后来我得知，丽江那里很多酒吧的乐队都有发一些小专辑什么的，不错，虽谈不上有什么大成就，但是也总算是按照他们自己的愿望去生活，想到这里，我还真有点羡慕他们。。。



day4

早上睡醒，已经是9点多了。。。一起来就觉得身体有所不适，有点感冒和水土不服的情况。。。

起床搞掂一切之后就过去找那2位女同学打算一起去吃早餐，不过她们早上没空，因为她们住的客栈的房被租出去了，她们要换客栈。。。后来我们只好自己到处逛逛，然后我迟到了这辈子最难吃的白粥。。。我真想说，你TM的真浪费大米。。。

后来找她们准备吃午饭，发现她们住的客栈非常不错，离四方街比我们那边近很多，而且价格也不算太贵，100元就有1个双人间，我那个朋友又在不断怂恿我搬到这家客栈住，好吧，他又赢了。。。我主要考虑到明天还要去泸沽湖，大家住在同一个客栈，出发时比较方便。。。后来搞掂这一切后发现都2点钟了。。。饿得不了了，在向客栈老板咨询一番后，我们决定去新城那边吃黑山羊。。。在忠义市场站搭公交车过去。。。去到后发现，真是琳琅满目，一条街都是黑山羊火锅店，家家挂的招牌都是正宗XXX，XX年老店。。。哎，此刻我的心情，你应该懂的。。。

后来我们去附件的小卖部买了瓶水，然后咨询下这个老板哪个比较好吃，然后结合下晚上搜索的结果。。。最终决定去那家吃，名字我忘记了。。。

上图：



因为今天我身体不适，就没有拍照，这图从我另外那个朋友微博里转过来的。。。味道还算不错吧，比之前吃的都好吃，不过价格也比之前的都贵。。。差不多每个人40元这样。。。

其实今天是最无聊的一天，丽江古城没什么好逛的，收费的景点我们又没预算去，加上我身体不适，以至于吃完饭后的行程也没什么多大好说的。。。

今天算是我在旅游中最痛苦的一天了，感冒加腹泻。。。在这里郑重叮嘱大家，一定要买保济丸和一些调剂肠胃水土不服的药过去。。。好险那2位女同学有感冒药，然后我另外那名同学有保济丸和肠胃药。。。多亏他们的高瞻远见，才让我后面的日子里过得舒服很多。。。

晚上，大家早早就休息了，因为预定了明天去泸沽湖的车票。。。在这里，我郑重告诉大家，千万不要坐客栈老板推荐的旅游专线（PS：因为几乎所有客栈老板都是说只能帮你预定这样，或者什么大多数人都是买这个票去的），简单点说，就是这个所谓的旅游专线，就是私人承包的，来回时间不准点，而且管理非常混乱，最严重的还要数司机带你去旅游点赚回佣。。。你可以想象一下，你给了钱买了车票，然后司机还载你去码头划船，你玩的话就是40元1个人（PS：后来我们木跨那边玩20元1个人，不限时间。。。），如果你不玩，那就在车上等着吧~~等他们玩回来了才继续开车，运气好1个小时，坏的话起码要2个小时。。。总之我们就是吃了这个亏了。。。我们总结了一下就是，不能相信既得利益者的话，即使他再友好，再对你怎么样，你都要相信没来之前做的攻略。。。不要被你短暂的情绪所蒙骗。。。



day5

早上6点半起床，擦，天还是黑的，月亮还挂在上面。。。丽江这边比较西边，傍晚7~8点还能看到猛烈的阳光。。。

如同我上面说的，早上我们等车的时候就后悔了，后悔相信客栈老板，定了这个旅游专线车。。。一大群人在那候车，看来好多人都和我们这样被骗鸟，管理非常混乱，本来说好7点20分的车，我们从7点等到了8点半才有车接我们。。。

然后这就是一段上贼船的坎坷经历。。。就此略过。。。这里提醒一下，记得买好零食准备好中午的午餐。。。因为路途遥远，中午会停车吃饭，然后。。。就像高速公路那样，吃的东西费用超高。。。你懂的~

稍微有点安慰的是，路上景色还不错，中途什么18弯等的景点也停留一下给我们拍照，这里不得不说那条河，忘记叫什么了，那水，颜色太迷人了。。。





最终，我们还是熬到了里格村。。。在这里，我们和丽江那2个北京的女同学分开了，因为搭车的事件更加坚定了我相信我自己做的攻略。。。所以我不打算妥协和她们在里格这边住。。。So，我和我朋友在她们到客栈安顿好后，就背上行李走了。。。

这里又是一段美好的回忆鸟~~ 我们从村子里走出来，然后村口这边有那些面包车，问我们去哪里，我说我们要到木跨去，咨询了下费用，要80元一车，然后只有我们2个人，找不到其他人拼车，只好作罢。。。我打算走路过去，然后在路边看能不能遇到什么顺风车或者拼车的朋友。。。

刚刚的时候还不好意思招手要别人停车，但是一路走啊走，心想，要是截不到车，擦，今晚睡哪里？我那个朋友可是全靠我了。。。想到这里我手心都捏出一把汗。。。就这样，一路走一路招手截车，瞬间有着专业驴友的赶脚。。。截了4~5部车，都是不顺路，或者满人了。。。最终在走了差不多20分钟后，截到一部本地人开的车，应该是去市集的吧，然后顺路，但是那位大哥表示要收点油费。。。我想，也ok，然后每个人给了20的费用给他（PS：后来我觉得还是有点贵，每人10元应该就可以了）。。。ok，最终安全到达木跨，来到我们电话预定好的客栈。。。来到之后，我才感慨，我要是不来这边，住里格，我真是遗憾一辈子啊。。。

看图：



看到木有，超级湖景房哦，坐在外面吹着风，听听湖边浪打的声音，还真是内心很宁静的说。。。



有点累，大家睡了一觉，然后起床找吃的。。。因为是淡季，而且木跨这边是属于四川境内，这边旅游没云南境内那边那么发达，所以我们走了好久才发现有一家开门的餐厅。。。2个人，点了2个菜，发现吃不完。。。点1个又发现太少。。。所以啊，以后出去人少得找人拼才行。。。后来在吃饭的时候，认识了那个饭店老板，他在草海那边还有1个酒店。。。说价格很便宜，可以60元给我们1个双人间，而且他免费载我们过去。。。我们回来就想着明天晚上就过去他那边住。。。

后来我们回来的时候见到好多村民穿了民族服饰去集合，一问才知道，原来饭店旁边的皇冠假日酒店搞篝火晚会。。。我那朋友一听，有走婚就神魂颠倒，这里BS一个。。。因为太累，而且感冒没完全好，洗完澡后的我就不愿意过去了。。。

最终。。。我们晚上躲在房间里聊天看电影度过。。。



⊙﹏⊙b汗，烂尾那么久了，新的旅程降至，终于我又要鼓起勇气继续写完它了。。。



day6

早上起床。。。还真是鸟语花香，在梦回迷蒙之间，听到湖边的水轻轻拍打岸边的声音。。。至今回想，还有一点点激动。。。幸亏昨晚买了牛奶面包，早餐就对着无敌湖景慢慢享受。。。另外那个朋友，翘着二郎腿，玩着平板，享受这难得的清新早晨。。。

吃完早餐，当然要去湖边玩玩。昨天刚到，安顿好后，天色都有点晚了，所以也没多探索周围的情况。。。我们下到1楼，问问老板，岸边的船找谁可以租来玩，老板给我们介绍了一个老人家，这船就是他老人家的。。。后来询问得知，原来这旅店的地也是这老人家的，他租给别人开旅店，租10年，貌似是租金每年涨8%，他家原来就是旅店后面挨着的那家民房。。。

老人家的船20块1个人，原则上可以不限时间（总不能中午不吃饭吧），不过实际玩不到2个小时就腻了。。。ok, 谈妥后，穿上救生衣，套上袋子（防止弄湿鞋），出发咯。。。





额。。。事实证明还是挺难划的，老人家不划的话，我们2个人怎么划都是原地转圈，丝毫木有前进的模样，身为高中时期的物理生，深知其动力学原理，却无法从实际上实现它。。。真是理论和实际差距太大鸟。。。

在船上我们也和老人家聊了好多东西，他几个儿子都在外面打工读书，老人家是土生土长的本地人。。。他说以前这里周围很多树木的（指山上，泸沽湖这里被山环绕着，这个户就是谷地的产物），后来都被人砍来做旅馆，现在光秃秃的了。。。不得不说，泸沽湖这里的水质还是不错的，老人家说，现在政府禁止机动船在泸沽湖上“走”，只允许人力这种，说了为了环保。。本来我还想着到湖里游泳的。。。但是发现太冷了，只好作罢，要是夏天来就爽咯，因为旅店距离湖边很近，游完就可以回去休息，爽爆了。。。







木办法，相机还是有色差，泸沽湖美还是要自己眼睛去感受。。。哈哈~~~ 划完船回来，我们到处走走，发现路边有些大妈骑三轮车出来卖东西，有些小鱼干，10快钱一包，那个大妈说都是泸沽湖里的鱼，自己打的，做一些出来卖。。当时木有买，现在想起还有些后悔，因为价格真心不贵。。。真是一个愉快的上午，就是什么也不干，坐着岸边，听听小鸟的叫声，听听岸边水拍打的声音，看看平静如镜的泸沽湖，身心真是豁然开朗~~

后来老人家的爱人邀请我们到他们家坐坐，还拿了些自制的零食出来招待我们，还不停的叫我吃吃看，真心觉得不好意思。。。





他们家里还养着马哦。。。

中午吃饭的时候我们就办理了退房，拿着行李去昨天吃饭的那个饭店吃饭，顺便去那家店的老板那边住，也就是草海。。一切进展的似乎很顺利。。。但是当我们到了草海后就发现，并不如此。。。到了之后，老板娘说这边60块的双人间没房了。。要不给我们住200块的豪华双人房。。我擦，我知道他们2公婆在唱双弹簧。。。后来最终谈妥100块给我们入住，不过晚上住的还不赖，有电热垫加热，房间的热水又大。。。后来我俩一致认为，赚了。。。

中午睡了一觉，下午准备去赵家湾那边看看。。走了好久，翻山越岭，最后还下雨了。。。没有雨伞的情况下，为了保护好手机和相机，再者害怕下雨山上路滑，之后中途折返，太遗憾了。。。不过一路上风景还行。。。



后来只能回到码头那边的餐厅里吃饭，顺便避避雨。。。点了什么菜忘记了，总之不好吃。。。消费了40~50块。。。回到酒店，坐下，正要感慨今天下午什么也没成的时候，草海外面，神奇的景象出现了。。。一句话，so beautiful！





在拍照的时候，认识了旅店旁边一间小卖部的小妹妹，大人都不在，就剩下她一个人看店，目测读小学5年级这样，后来借平板给她玩游戏，她还给了我个店里全场8折off。。。真是人小鬼大。。。后来买了2瓶百宝粥做第二天早餐。。。

晚上草海这边很黑，木有神马活动，只好在旅店里开电影度过，话说开着电热毯还真是舒服。。



day 7

早上起床吃完早餐，就立即退房出发了。。。因为今天任务很重，昨晚打电话预约了后台里格回丽江的车。。。今天要是到不了里格就惨了。。。而且从草海距离泸沽镇好远，起码要走上一段时间。。。我们的计划是一路走出去，走到泸沽镇的大马路的话就看看能不能截到顺风车搭我们到里格去，预算是20块1个人。。。

走路出去的时候，经过博物馆时还想进去看看的，进去一看可惜不开门，只好作罢，继续赶路。。。后来遇到一部车，问我们到那里，我说里格，他要100块，我说我们没那么多钱，不好意思。。。司机大哥看不下去了，说道：“你难道还想走路去？你上车，我免费搭你到泸沽镇，那边车多，看能不能找几个拼”。。真是太幸运了，否则真的可能要走路1个多小时才能走到泸沽镇。。司机到了泸沽镇，就拼命想找多2个人来和我们拼车。。也差不多到中午了，我们就下车找吃的了，留了电话给司机，要是找到人了就打电话给我们。。。去了菜市场逛了一圈，没发现什么好吃的东西，倒是发现了个面包店，发现有一种面包不错又便宜，价格忘记是多少来着了，后来就每人买了几个加一瓶矿泉水解决午餐。。。还是泸沽镇上的物价便宜点。。

后来在泸沽镇上到处看看，发现，泸沽镇也有一个车站，有一班车是从四川的攀枝花到泸沽镇的。。当时做攻略没发现这点，浪费了，应该从泸沽湖继续玩到攀枝花去，这样可以直接到四川玩了，之后再从四川回广州。。。，而不是又原地返回丽江，又返回昆明，然后再回广州。。。

中午时间差不多了，司机还找不到人和我们拼车，没办法了，只好自己在路边截车。。。问了很多辆车，都木有结果，要么不顺路去那边的，要么人家压根不鸟你。。。就在担心今晚是否要露宿街头之际，司机大哥伟大的身影出现在我们面前，司机大哥看不下去了，说道：“没办法了，50块搭你们过去吧，你们在这里截不到车的”。。。比预算多了5块钱而已，我们立即答应了，还连忙感谢司机大哥的帮助。。。

路上也和司机大哥聊了很多，司机大哥之前也到过深圳这边打工，后来回来开车谋生了。。他说以前这边，泸沽湖里很多鸟的，小时候没钱都是抓鸟来下菜。。。他说不过那时候交通非常不方便，走路出去外面要1个多月。。。走路1个月，擦，我都吓尿了。。。

顺利到达里格，司机大哥还推荐了一家便宜的旅店给我们，不过我们进去问了，没房了。。。只好自己去寻找了。。。走了10分钟，发现一家旅店写着特价床位30元一位，果断进去看了下房间，不错，干净卫生。。。立即入住。。。后来在里格这边到处走走玩玩。。。这边也还是挺安静的。。。不错。。。







day 8

今天预约了回丽江的车，电话上说好了9点的车。。。后来推迟到11点，最后等到差不多1点。。。我真是不想说太多，果断打电话投诉司机，司机还问我们是不是我们投诉他。。。我说是，他还愤愤不平，说有2个人没到，要等他们，不可以先走。。。那2个人向我们道歉说不关司机的事，是他们的电动车没电了，所以拖了几个小时。。。我可以理解他们的遭遇，也可以理解司机选择等他们的，但是我没办法接受。。。车上有那么多人，为了2个迟到的人，耽误了那么多人的时间，发车时间也是提前通知好的了，况且我们晚上还要坐火车的大理，我只想对那2个迟到的人和司机说，我可以理解，但是我不能接受这样的结果。。。

回到丽江后，去超市买了快餐和补充点干粮，接着搭车到火车站，托那2个迟到的乘客的福，没有坐票了，只能买站票，站2个小时到大理。。。在火车站候车，吃饭吃到一半，就开始进站了，妈蛋，匆匆忙忙进站乘车。。。

火车上我们站的位置旁边有对情侣，我见他们不像坏人，就问他们是否也是到大理的，他们说嗯，然后我就问他们要不要一起拼车到大理，因为到大理的时候也挺晚了，没有公交车了。。。然后一拍即合。。。最后大家一起打D过去。。。晚上打D真黑啊。。那司机假装不懂路，明明都到了，还在装，分明是想多走一圈，司机大哥，你演技太差了。。。

最郁闷的事情发生了，我们叫了青旅的人来接我们进去，到了青旅才发现，他们没床位了，其他的房又太贵。。。最后去了旅店老板推荐的，另外一家青旅住，价格很厚道，30块一晚。。。要是住一个月的话，可以便宜点，大概500多就可以了。。。我发现，在大理玩的人一般都住很长时间，就说和我们住在同一个房间的那位同学，应届毕业，住了差不多1个月了，在大理写论文。。。我只想说，太尼玛爽了。。。我想起了那句话：“生活就像旅游，旅游就像生活”，我相信他做到了后者，这位同学，年纪轻轻，却临床经验丰富，竟然骑过了川藏线，哎呀，我听了真是觉得我的青春给狗吃了，创业没下文，大学除了在宿舍玩电脑，没了。。。



day 9

大理的气候，果然比丽江舒服点。。。没丽江那么冷，稍微暖和点。。。今天的行程是骑车环游大理。。。



你听过唐人街，没听过洋人街吧？给你看看



据说这里长期住了很多外国人，话说我对大理真的有好感，这里气候舒服点，然后物价什么的比丽江便宜，商业气息没丽江那么浓厚。。。



到大理的影视城看看。。。这里因为我们没钱，最后逃票爬墙进去玩了一圈。。。这里严重不推荐逃票哈。。。



下午我们环国道骑车，看到大理古城真的很漂亮，阳光照射下来，感觉像来了天堂那样



湿地公园拍的部分图片：





真的so beautiful。。。回来之后我一直都在说，靠，大理比丽江好玩多了。。。可惜，在大理逗留的时间太短了。。。洱海那边我们还没有去呢。。。也许，就像峰哥那样，下次再来大理，得要专程来大理，住上半个月，用生活的态度去享受这里的美景。。。

晚上吃完饭，坐晚上的火车到昆明，睡一觉，明天早上6点半就到了。。。



day 10

到了昆明火车站。。。因为我们有今天晚上回昆明到广州的火车票，所以可以到候车厅里坐，居然让我们发现候车厅有充电器。。。这下乐坏我们了，赶紧拿手机平板出来充电。。。今天是云南之旅的最后一段行程。。。今天的行程是游云南大学，和去园艺博览会看看。。木错，我们的导游是火车上认识那位大四妹子，小李同学。。。

9点钟的时候，我们打电话给她，预约了下见面的地点和时间。。。因为这个时间没有海鸥了，所以就没去那个什么公园了。。。直接出发云南大学。。。不过发现，也没什么好看的。。。倒是大学附近一间店里面吃的午餐非常不错。。。特喜欢那个什么粥，人生第一次喝加冰的粥，里面还有水果，哈哈，好吃。。。非常过意不去的是，本来是我们想请她们吃的，毕竟要人家带我们到处看，木想到她抢着和我们卖单。。。她说，下次来广州我们再请回她，无奈之下，也只能这样。。。

还是下午园艺博览会那边的景色好看点。。里面有各个国家的一些建筑风格，园艺风格可以看。。在里面，我人生第一次见到活的枫叶。。。





大菠萝





快乐的时光总会过得特别快。。。谢谢你们带我们游昆明。。。晚上的昆明塞车，据说是昆明地铁施工造成的。。差点赶不上了火车。。。买了面包，在火车上解决。。。

本想着旅程就这么结束了， NO NO，在火车上，我认识了一群来广州拍微电影的人，有幸认识他们的导演。。。俗称张导。。。还认识了2位偷偷逃课跑出来旅游的，在南宁读医同学。。。

晚上，和张导和摄影师，加上我和我朋友，4人围成一席，举酒畅饮，我第一次在火车上和人劈酒。。。多亏火车上有酒可以买。。。饮酒期间，我们畅谈天地，从聊天可以得知，张导是一位经验丰富的人，有丰富的观察能力，他之前是在美国读的电影专业，然后回国发展，虽然目前没有成名或者大富大贵，但是，依旧掩盖不了，他是一位经验丰富的智者。。。现在想起，真是可惜没有好好把握这个机会，多聊聊一些自己想不通的事情。。。

喝酒期间还发现一个小插曲，火车上广播说，某个车厢里有一位病人需要帮助，问有没有哪位乘客是医生可以帮助的。。。我听到后就立即询问了车厢的工作人员（因为广播台就在我们那截车厢里），工作人员说，有个乘客流鼻血，血流不止。。。我突然想起，刚刚认识那2位逃课出来旅游的同学，我赶紧把她们2个叫醒。。。现在回想起，真是感谢她们没有骂我或者打我。。。我把她们从睡梦中叫醒，然后叫她们去帮忙，没想到，她们没有任何怨气，了解完情况后就立即出发，隔壁床的男同学，听到情况后，主动提供帮助，拿了一瓶云南白药和她们2个杀了过去，因为部分车厢不通，还要等到站后下车跑过去。。。

后来搞了好久，她们才回来。。。我连忙和她们道歉，说不好意思把你们叫醒，没想到她们竟然没有一丝怪我，还说，那个病人很感谢我。。。她们还请我吃糖。。。第二天一早到南宁她们就下车了，虽然没有一句道别，但是我想对她们说一声谢谢！



完结

旅行到这里就结束了。。。旅游就像一个生活的浓缩，有开心，又不开心，会遇到朋友，也会遇到骗子。。。这次的旅途最让我满意的是，一路上都和不同的人交流，沟通，交朋友，幸亏他们都是好人，也幸亏没有发生什么非常不幸的事情，谢谢大家！';

$str = str_replace("\n", '', $str);
$i = 0;
$result = array();
while (true) {
    $data = mb_substr($str, $i, 2, 'utf-8');
    if (preg_match('/^[\w\x{4e00}-\x{9fa5}]+$/u', $data) === 1) {
        $nextWord = mb_substr($str, $i+2, 1, 'utf-8');
        // if (preg_match('/^[\w\x{4e00}-\x{9fa5}]+$/u', $nextWord) === 1) {
            $result[$data][] = $nextWord;
        // }
    }

    if (strlen($str) < $i) {
        break;
    }
    $i++;
}

echo say($argv[1]), PHP_EOL;


function say($start='')
{
    global $result;
    $key = $start;
    $allWord = $start;
    while (isset($result[$key])) {
        $i = array_rand($result[$key]);
        $allWord .= $result[$key][$i];
        $key = mb_substr($allWord, -2, 2, 'utf-8');
    }

    return $allWord;
}

?>
